# ResourceType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceMatchOptions..::..ResourceType Property
ExternalResourceMatchOptions Class See Also
---
The desired resource type which external resources should match.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceType ResourceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ResourceType As ExternalResourceType
	Get
```

Visual C++
---
```text
public:
property ExternalResourceType^ ResourceType {
	ExternalResourceType^ get ();
}
```

# See Also
ExternalResourceMatchOptions Class
Autodesk.Revit.DB Namespace